<?php

class myclass{  //оголошення класу повинно бути з великої літери та StudlyCaps, відкриваюча дужка повинна бути під оголошеним класом
    use someTrait, anotherTrair; //кожен треіт маєпідлючатись на новій строці і мати своє власне ключове слово use; класи, трейти, інтерфейси повинні починатись з великої літери і використовувати StudlyCaps
    public $Myarray=[]; // відсутній тип даних, властивості мають бути написані з використанням camelCase
    function __construct(){ //відкриваюча дужка повинна бути під оголошеним методом, відсутній ідентифікатор доступу
        $this->Myarray=[]; //оператори повинні бути відділені пробілами з обох сторін
        echo 'done'; //side effect

} //закриваюча дужка повинна бути на одному рівні з методом до якого належить
    function some_method($a) // відсутній ідентифікатор доступу, використання snake_case, відсутність типу параметра, відсутність типу даних що повертаються з функції
    {
        $result=0; //додана табуляція
     $result=$result+$a*$result-$a; // всі оператори повинні відокремлюватись пробілами з обох боків
            return $result; //додана табуляція
    }

    function anotherMethod($b){ // відсутній ідентифікатор доступу, відсутність типу параметра, відсутність типу даних що повертаються з функції
          $result=0; //додана табуляція
            $result=$result+$b*$result-$b; // всі оператори повинні відокремлюватись пробілами з обох боків додана табуляція
         return $result;
        } //додана табуляція
}
